CREATE TABLE IF NOT EXISTS rule_tbl
(
    user_id int,
    name string,
    age     int,
    sex     int,
    address string
) comment '测试flink读写hive数据' partitioned by (`dt` STRING,`hm` STRING)
    stored as orc
    location '/user/hive/warehouse/rule_tbl'
    tblproperties("orc.compress" = "snappy")


CREATE TABLE IF NOT EXISTS user_behavior_tbl
(
    user_id     bigint,
    item_id     int,
    category_id bigint,
    behavior string,
    ts          bigint
) comment 'UserBehavior.csv' partitioned by (`dt` STRING,`hm` STRING)
    stored as orc
    location '/user/hive/warehouse/user_behavior_tbl'
    tblproperties("orc.compress" = "snappy")



insert into rule_tbl partition (dt='20220607',hm='2000')
values (1016727, 'Mary', 10, 1, '中国北京市')


insert into rule_tbl
select user_id,
       name,
       age,
       sex,
       address,
       from_unixtime(unix_timestamp(), 'yyyyMMdd') as dt,
       '2100'                                      as hm
from source_tbl


-- file connector read UserBehavior.csv
create table if not exists file_soure_tbl
(
    user_id     bigint,
    item_id     int,
    category_id bigint,
    behavior string,
    ts          bigint
        row_time as to_timestamp(from_unixtime(ts,'yyyy-MM-dd HH:mm:ss')),
    watermark for row_time as row_time - interval '1' second
)
with (
    'connector' = 'filesystem',
    'path' = 'file:///D:/workspace/flink_/files/UserBehavior.csv',
    'format' = 'csv',
    'csv.ignore-parse-errors' = 'true',
    'csv.allow-comments' = 'true'
)

-- create hive table
create table if not exists user_behavior_tbl
(
    user_id     bigint,
    item_id     int,
    category_id bigint,
    behavior string,
    ts          bigint
) comment 'UserBehavior.csv' partitioned by (`dt` string,`hm` string)
    stored as orc
    location '/user/hive/warehouse/user_behavior_tbl'
    tblproperties(
        'orc.compress' = 'snappy',
        'partition.time-extractor.timestamp-pattern'='$dt $hr:00:00',
        'sink.partition-commit.trigger'='partition-time',
        'sink.partition-commit.delay'='5 min',
        'sink.partition-commit.watermark-time-zone'='Asia/Shanghai', -- Assume user configured time zone is 'Asia/Shanghai'
        'sink.partition-commit.policy.kind'='metastore,success-file'
    )

-- insert
insert into user_behavior_tbl
select user_id,
       item_id,
       category_id,
       behavior,
       ts,
       DATE_FORMAT(row_time, 'yyyyMMdd'),
       DATE_FORMAT(row_time, 'HH')
from file_soure_tbl



drop table if exists file_soure_tbl



CREATE TABLE kafka_source_tbl
(
    `userId`     INT,
    `itemId`     BIGINT,
    `categoryId` INT,
    `behavior` STRING,
    `ts`         BIGINT,
    row_time     AS TO_TIMESTAMP(FROM_UNIXTIME(ts / 1000, 'yyyy-MM-dd HH:mm:ss')),
    WATERMARK FOR row_time AS row_time - INTERVAL '1' SECOND
)
WITH (
    'connector' = 'kafka',
    'topic' = 'user_behaviors',
    'properties.bootstrap.servers' = 'hadoop102:9092,hadoop103:9092,hadoop104:9092',
    'properties.group.id' = 'test-group-id',
    'scan.startup.mode' = 'earliest-offset',
    'format' = 'json'
);


create
catalog myhive with('type'='hive','hive-conf-dir'='/opt/module/hive-3.1.2/conf','default-database'='default','hive-version'='3.1.2','hadoop-conf-dir'='/opt/module/hadoop-3.1.3/etc/hadoop');
use catalog myhive;
load
module hive;
use modules hive,core;

set table.sql -dialect = hive;


CREATE TABLE if not exists kafka_source_tbl
(
    `userId`     INT,
    `itemId`     BIGINT,
    `categoryId` INT,
    `behavior` STRING,
    `ts`         BIGINT,
    row_time     AS TO_TIMESTAMP(FROM_UNIXTIME(ts / 1000, 'yyyy-MM-dd HH:mm:ss')),
    WATERMARK FOR row_time AS row_time - INTERVAL '1' SECOND
)
WITH (
    'connector' = 'kafka',
    'topic' = 'user_behaviors',
    'properties.bootstrap.servers' = 'hadoop102:9092,hadoop103:9092,hadoop104:9092',
    'properties.group.id' = 'test-group-id',
    'scan.startup.mode' = 'earliest-offset',
    'format' = 'json'
);


insert into user_behavior_tbl
select CAST(userId AS BIGINT)     as user_id,
       CAST(itemId AS INT)        as item_id,
       CAST(categoryId AS BIGINT) as category_id,
       behavior,
       ts,
       DATE_FORMAT(row_time, 'yyyyMMdd'),
       DATE_FORMAT(row_time, 'HH')
from kafka_source_tbl



create table if not exists user_behavior_tbl
(
    user_id     bigint,
    item_id     int,
    category_id bigint,
    behavior string,
    ts          bigint,
    `dt` string,
    `hm` string
) partitioned by (`dt`,`hm`)
with(
    'connector'='filesystem',
    'path'='hdfs://hadoop102:8020/user/hive/warehouse/user_behavior_tbl/',
    'format'='orc',
    'partition.time-extractor.timestamp-pattern'='$dt $hour:00:00',
    'sink.partition-commit.delay'='1 min',
    'sink.partition-commit.trigger'='partition-time',
    'sink.partition-commit.watermark-time-zone'='Asia/Shanghai', -- Assume user configured time zone is 'Asia/Shanghai'
    'sink.partition-commit.policy.kind'='success-file'
)



load data inpath '/user/hive/warehouse/user_behavior_tbl/' into table default.student


set default.parallelism = 1
set max -parallelism = 4
set table.sql -dialect = default;
SET 'execution.checkpointing.interval' = '10 s';
SET 'execution.runtime-mode' = 'streaming';


CREATE TABLE IF not exists kafka_source_tbl
(
    `userId`     INT,
    `itemId`     BIGINT,
    `categoryId` INT,
    `behavior` STRING,
    `ts`         BIGINT,
    row_time     as TO_TIMESTAMP(FROM_UNIXTIME(ts / 1000, 'yyyy-MM-dd HH:mm:ss')),
    WATERMARK FOR row_time AS row_time - INTERVAL '1' SECOND
)
WITH (
    'connector' = 'kafka',
    'topic' = 'user_behaviors',
    'properties.bootstrap.servers' = 'hadoop102:9092,hadoop103:9092,hadoop104:9092',
    'properties.group.id' = 'test-group-id',
    'scan.startup.mode' = 'earliest-offset',
    'format' = 'json',
    'json.ignore-parse-errors' = 'true'
)



insert into user_behavior_tbl
select CAST(userId AS BIGINT)     as user_id,
       CAST(itemId AS INT)        as item_id,
       CAST(categoryId AS BIGINT) as category_id,
       behavior,
       ts,
       DATE_FORMAT(row_time, 'yyyyMMdd'),
       DATE_FORMAT(row_time, 'HH')
from kafka_source_tbl


-- create mysql data
create table if not exists orders_tbl
(
    order_id      int            not null,
    order_date    datetime       not null,
    customer_name varchar(64)    not null,
    price         decimal(10, 5) not null,
    product_id    int,
    order_status  boolean,
    primary key (order_id)
)

insert into orders_tbl(order_id, order_date, customer_name, price, product_id, order_status)
values (10001, '2021-10-18 08:30:59', 'u_1', 100.50, 360004, 1),
       (10002, '2021-11-18 05:25:36', 'u_2', 1.90, 360006, 0),
       (10003, '2021-11-19 10:06:09', 'u_3', 21.60, 360056, 1),
       (10004, '2021-11-17 17:15:56', 'u_4', 16.00, 360034, 1),
       (10005, '2021-11-17 16:23:16', 'u_1', 89.00, 360013, 0),
       (10006, '2021-11-18 09:46:19', 'u_2', 102.00, 360044, 1)


-- =====================================================================================================

DROP TABLE IF EXISTS `order_info`;

CREATE TABLE `order_info`
(
    `id`                     bigint(20) NOT NULL AUTO_INCREMENT COMMENT '编号',
    `consignee`              varchar(100)   DEFAULT NULL COMMENT '收货人',
    `consignee_tel`          varchar(20)    DEFAULT NULL COMMENT '收件人电话',
    `total_amount`           decimal(10, 2) DEFAULT NULL COMMENT '总金额',
    `order_status`           varchar(20)    DEFAULT NULL COMMENT '订单状态',
    `user_id`                bigint(20)     DEFAULT NULL COMMENT '用户id',
    `payment_way`            varchar(20)    DEFAULT NULL COMMENT '付款方式',
    `delivery_address`       varchar(1000)  DEFAULT NULL COMMENT '送货地址',
    `order_comment`          varchar(200)   DEFAULT NULL COMMENT '订单备注',
    `out_trade_no`           varchar(50)    DEFAULT NULL COMMENT '订单交易编号（第三方支付用)',
    `trade_body`             varchar(200)   DEFAULT NULL COMMENT '订单描述(第三方支付用)',
    `create_time`            datetime       DEFAULT NULL COMMENT '创建时间',
    `operate_time`           datetime       DEFAULT NULL COMMENT '操作时间',
    `expire_time`            datetime       DEFAULT NULL COMMENT '失效时间',
    `process_status`         varchar(20)    DEFAULT NULL COMMENT '进度状态',
    `tracking_no`            varchar(100)   DEFAULT NULL COMMENT '物流单编号',
    `parent_order_id`        bigint(20)     DEFAULT NULL COMMENT '父订单编号',
    `img_url`                varchar(200)   DEFAULT NULL COMMENT '图片路径',
    `province_id`            int(20)        DEFAULT NULL COMMENT '地区',
    `activity_reduce_amount` decimal(16, 2) DEFAULT NULL COMMENT '促销金额',
    `coupon_reduce_amount`   decimal(16, 2) DEFAULT NULL COMMENT '优惠券',
    `original_total_amount`  decimal(16, 2) DEFAULT NULL COMMENT '原价金额',
    `feight_fee`             decimal(16, 2) DEFAULT NULL COMMENT '运费',
    `feight_fee_reduce`      decimal(16, 2) DEFAULT NULL COMMENT '运费减免',
    `refundable_time`        datetime       DEFAULT NULL COMMENT '可退款日期（签收后30天）',
    PRIMARY KEY (`id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 32950
  DEFAULT CHARSET = utf8 COMMENT ='订单表 订单表';

/*Data for the table `order_info` */

insert into `order_info`
(`id`, `consignee`, `consignee_tel`, `total_amount`, `order_status`, `user_id`, `payment_way`, `delivery_address`,
 `order_comment`, `out_trade_no`, `trade_body`, `create_time`, `operate_time`, `expire_time`, `process_status`,
 `tracking_no`, `parent_order_id`, `img_url`, `province_id`, `activity_reduce_amount`, `coupon_reduce_amount`,
 `original_total_amount`, `feight_fee`, `feight_fee_reduce`, `refundable_time`)
values (32859, '濮阳坚和', '13999074877', '123.00', '1001', 3, NULL, '第2大街第11号楼8单元115门', '描述661855', '344869551147912',
        '十月稻田 长粒香大米 东北大米 东北香米 5kg等3件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL,
        NULL, NULL, 'http://img.gmall.com/466955.jpg', 4, '0.00', '0.00', '117.00', '6.00', NULL, NULL),
       (32860, '李达安', '13389278442', '2918.00', '1004', 4, NULL, '第6大街第11号楼3单元232门', '描述815844', '123323149722781',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 冰雾白 游戏智能手机 小米 红米等5件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/261479.jpg', 11, '0.00', '0.00', '2898.00', '20.00', NULL, NULL),
       (32861, '范震振', '13027178591', '540.00', '1004', 6, NULL, '第1大街第23号楼3单元693门', '描述773367', '286281252818826',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Y01复古红 百搭气质 璀璨金钻哑光唇膏 等8件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/639517.jpg', 23, '0.00', '100.00', '632.00',
        '8.00', NULL, NULL),
       (32862, '熊航弘', '13173687515', '28220.00', '1004', 10, NULL, '第19大街第25号楼3单元112门', '描述679596', '212882772911523',
        'TCL 75Q10 75英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/323383.jpg', 22, '0.00',
        '0.00', '28205.00', '15.00', NULL, NULL),
       (32863, '卫全', '13547311311', '23782.00', '1004', 14, NULL, '第16大街第15号楼5单元952门', '描述263393', '443217854246359',
        '小米电视4A 70英寸 4K超高清 HDR 二级能效 2GB+16GB L70M5-4A 内置小爱 智能网络液晶平板教育电视等5件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/638736.jpg', 24, '0.00',
        '0.00', '23771.00', '11.00', NULL, NULL),
       (32864, '成生龙', '13654694328', '30467.00', '1004', 15, NULL, '第3大街第12号楼3单元188门', '描述476718', '819155173492954',
        'TCL 65Q10 65英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等8件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/355658.jpg', 28, '0.00',
        '0.00', '30459.00', '8.00', NULL, NULL),
       (32865, '独孤雁蓓', '13463780399', '2713.00', '1001', 19, NULL, '第10大街第27号楼5单元662门', '描述791497', '595952959637574',
        '金沙河面条 原味银丝挂面 龙须面 方便速食拉面 清汤面 900g等8件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32',
        NULL, NULL, NULL, 'http://img.gmall.com/187729.jpg', 23, '0.00', '70.00', '2768.00', '15.00', NULL, NULL),
       (32866, '李慧巧', '13593230790', '34320.00', '1004', 22, NULL, '第6大街第27号楼8单元742门', '描述297922', '218369283868275',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 冰雾白 游戏智能手机 小米 红米等10件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/717855.jpg', 14, '0.00', '0.00', '34308.00', '12.00', NULL, NULL),
       (32867, '伏燕', '13762166267', '24517.00', '1001', 23, NULL, '第12大街第5号楼9单元238门', '描述836951', '817674987339698',
        'Apple iPhone 12 (A2404) 128GB 黑色 支持移动联通电信5G 双卡双待手机等7件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/978358.jpg', 33, '0.00', '70.00', '24569.00',
        '18.00', NULL, NULL),
       (32868, '滕世', '13451575092', '47287.00', '1004', 25, NULL, '第12大街第4号楼7单元393门', '描述983431', '796123688967655',
        '小米电视4A 70英寸 4K超高清 HDR 二级能效 2GB+16GB L70M5-4A 内置小爱 智能网络液晶平板教育电视等12件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/734765.jpg', 16, '0.00',
        '0.00', '47272.00', '15.00', NULL, NULL),
       (32869, '陶惠', '13957005246', '39148.00', '1001', 26, NULL, '第14大街第14号楼4单元172门', '描述937594', '332184418896627',
        'TCL 65Q10 65英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/679816.jpg', 31, '0.00',
        '0.00', '39134.00', '14.00', NULL, NULL),
       (32870, '康宜', '13831546658', '23024.00', '1004', 28, NULL, '第6大街第10号楼4单元994门', '描述281669', '223118896358426',
        '华为智慧屏V55i-J 55英寸 HEGE-550B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 银钻灰 京品家电等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/447213.jpg', 6, '0.00',
        '0.00', '23016.00', '8.00', NULL, NULL),
       (32871, '柏楠', '13446070200', '18901.00', '1004', 36, NULL, '第14大街第20号楼6单元236门', '描述136289', '522895491194968',
        'TCL 75Q10 75英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等3件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/573592.jpg', 18, '0.00',
        '0.00', '18886.00', '15.00', NULL, NULL),
       (32872, '魏海', '13360266657', '13780.00', '1001', 38, NULL, '第2大街第12号楼4单元788门', '描述234119', '161992517499211',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M01醉蔷薇等3件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/121394.jpg', 15, '0.00', '0.00', '13765.00',
        '15.00', NULL, NULL),
       (32873, '金力', '13571165771', '9219.00', '1005', 40, NULL, '第16大街第40号楼3单元546门', '描述148425', '957741282273364',
        'TCL 75Q10 75英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等1件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/639337.jpg', 30, '0.00',
        '0.00', '9199.00', '20.00', NULL, NULL),
       (32874, '司空可', '13628717995', '14938.00', '1001', 41, NULL, '第1大街第39号楼2单元351门', '描述631349', '379733488786464',
        '香奈儿（Chanel）女士香水5号香水 粉邂逅柔情淡香水EDT 粉邂逅淡香水35ml等6件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/965555.jpg', 18, '0.00', '0.00', '14928.00',
        '10.00', NULL, NULL),
       (32875, '毛和彪', '13030509846', '33207.00', '1004', 44, NULL, '第18大街第27号楼4单元761门', '描述757942', '449686927811568',
        '华为智慧屏V65i 65英寸 HEGE-560B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 4GB+32GB 星际黑等6件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/778398.jpg', 14, '0.00',
        '0.00', '33190.00', '17.00', NULL, NULL),
       (32876, '黄翠', '13964084767', '24603.00', '1001', 45, NULL, '第17大街第5号楼3单元178门', '描述943538', '996498936216635',
        '小米10 至尊纪念版 双模5G 骁龙865 120HZ高刷新率 120倍长焦镜头 120W快充 12GB+256GB 陶瓷黑 游戏手机等4件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/963436.jpg', 20, '700.00',
        '0.00', '25296.00', '7.00', NULL, NULL),
       (32877, '何德', '13240618435', '41846.00', '1004', 47, NULL, '第6大街第31号楼7单元938门', '描述883119', '978835697727157',
        '华为 HUAWEI P40 麒麟990 5G SoC芯片 5000万超感知徕卡三摄 30倍数字变焦 8GB+128GB亮黑色全网通5G手机等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/666925.jpg', 17, '0.00',
        '30.00', '41863.00', '13.00', NULL, NULL),
       (32878, '薛馥', '13923120860', '10845.00', '1001', 48, NULL, '第13大街第26号楼1单元556门', '描述116816', '444417348762159',
        '金沙河面条 原味银丝挂面 龙须面 方便速食拉面 清汤面 900g等7件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32',
        NULL, NULL, NULL, 'http://img.gmall.com/521699.jpg', 33, '0.00', '70.00', '10896.00', '19.00', NULL, NULL),
       (32879, '陶芬芳', '13300914517', '36240.00', '1004', 50, NULL, '第3大街第28号楼1单元449门', '描述129113', '976992133326676',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M01醉蔷薇等12件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/311899.jpg', 17, '0.00', '70.00', '36290.00',
        '20.00', NULL, NULL),
       (32880, '常达', '13320572200', '81.00', '1001', 52, NULL, '第1大街第30号楼9单元741门', '描述249125', '665289625289347',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z03女王红 性感冷艳 璀璨金钻哑光唇膏 等1件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/643227.jpg', 18, '0.00', '30.00', '99.00',
        '12.00', NULL, NULL),
       (32881, '沈蓉', '13082998647', '15908.00', '1004', 53, NULL, '第4大街第32号楼1单元824门', '描述928365', '878949588252635',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 8GB+128GB 明月灰 游戏智能手机 小米 红米等4件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/393696.jpg', 10, '0.00', '0.00', '15896.00', '12.00', NULL, NULL),
       (32882, '长孙伯宏', '13245185866', '17778.00', '1004', 60, NULL, '第3大街第36号楼6单元984门', '描述398537', '979351747767793',
        '华为智慧屏V65i 65英寸 HEGE-560B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 4GB+32GB 星际黑等6件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/325393.jpg', 31, '0.00',
        '0.00', '17772.00', '6.00', NULL, NULL),
       (32883, '司徒娅琦', '13095594231', '17131.00', '1005', 64, NULL, '第2大街第32号楼9单元871门', '描述181287', '661677671552985',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Y01复古红 百搭气质 璀璨金钻哑光唇膏 等11件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/283694.jpg', 12, '0.00', '100.00', '17219.00',
        '12.00', NULL, NULL),
       (32884, '闻人颖', '13317085443', '24603.00', '1001', 66, NULL, '第10大街第35号楼2单元264门', '描述693728', '536376853358882',
        'Apple iPhone 12 (A2404) 64GB 红色 支持移动联通电信5G 双卡双待手机等3件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/213212.jpg', 4, '0.00', '0.00', '24591.00',
        '12.00', NULL, NULL),
       (32885, '秦成康', '13025807970', '12335.00', '1004', 67, NULL, '第18大街第5号楼1单元683门', '描述841194', '966993777129882',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M02干玫瑰等10件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/188642.jpg', 19, '0.00', '70.00', '12390.00',
        '15.00', NULL, NULL),
       (32886, '和环', '13785301547', '22269.00', '1004', 68, NULL, '第5大街第7号楼3单元391门', '描述338353', '129495948474373',
        'Apple iPhone 12 (A2404) 128GB 黑色 支持移动联通电信5G 双卡双待手机等5件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/795156.jpg', 16, '0.00', '0.00', '22249.00',
        '20.00', NULL, NULL),
       (32887, '柏军平', '13071819104', '41810.00', '1005', 69, NULL, '第18大街第27号楼3单元191门', '描述192957', '625122466338831',
        '小米10 至尊纪念版 双模5G 骁龙865 120HZ高刷新率 120倍长焦镜头 120W快充 8GB+128GB 透明版 游戏手机等5件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/634177.jpg', 2, '0.00',
        '0.00', '41793.00', '17.00', NULL, NULL),
       (32888, '郑珍', '13794030202', '14692.00', '1004', 73, NULL, '第17大街第3号楼4单元367门', '描述914394', '396513835862637',
        '华为 HUAWEI P40 麒麟990 5G SoC芯片 5000万超感知徕卡三摄 30倍数字变焦 6GB+128GB亮黑色全网通5G手机等6件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/154581.jpg', 32, '0.00',
        '0.00', '14685.00', '7.00', NULL, NULL),
       (32889, '乐伊', '13954809450', '16884.00', '1005', 76, NULL, '第2大街第16号楼8单元899门', '描述119897', '138814875935667',
        '金沙河面条 银丝挂面900g*3包 爽滑 细面条 龙须面 速食面等7件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32',
        NULL, NULL, NULL, 'http://img.gmall.com/748555.jpg', 26, '700.00', '70.00', '17637.00', '17.00', NULL, NULL),
       (32890, '鲁飘育', '13890545956', '22615.00', '1005', 77, NULL, '第3大街第37号楼3单元193门', '描述977746', '817818163535363',
        '华为 HUAWEI P40 麒麟990 5G SoC芯片 5000万超感知徕卡三摄 30倍数字变焦 8GB+128GB冰霜银全网通5G手机等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/411623.jpg', 21, '0.00',
        '0.00', '22602.00', '13.00', NULL, NULL),
       (32891, '卜淑', '13094215142', '12700.00', '1001', 78, NULL, '第2大街第39号楼2单元625门', '描述393666', '576312564334732',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 8GB+128GB 明月灰 游戏智能手机 小米 红米等6件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/947326.jpg', 11, '0.00', '0.00', '12694.00', '6.00', NULL, NULL),
       (32892, '苗盛', '13217650208', '26432.00', '1004', 79, NULL, '第1大街第25号楼8单元477门', '描述135858', '525922811377123',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M02干玫瑰等10件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/882277.jpg', 24, '0.00', '70.00', '26497.00',
        '5.00', NULL, NULL),
       (32893, '淳于杰', '13349882553', '33366.00', '1001', 82, NULL, '第12大街第12号楼2单元924门', '描述259868', '716288436621894',
        'TCL 85Q6 85英寸 巨幕私人影院电视 4K超高清 AI智慧屏 全景全面屏 MEMC运动防抖 2+16GB 液晶平板电视机等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/541641.jpg', 29, '500.00',
        '0.00', '33860.00', '6.00', NULL, NULL),
       (32894, '窦谦', '13429542312', '3015.00', '1004', 83, NULL, '第4大街第3号楼8单元442门', '描述339721', '688429875322934',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 冰雾白 游戏智能手机 小米 红米等3件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/618832.jpg', 12, '0.00', '0.00', '2997.00', '18.00', NULL, NULL),
       (32895, '孔武新', '13532389249', '45724.00', '1004', 84, NULL, '第6大街第11号楼9单元925门', '描述932827', '898737786356633',
        'Apple iPhone 12 (A2404) 128GB 黑色 支持移动联通电信5G 双卡双待手机等12件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/653743.jpg', 23, '0.00', '0.00', '45719.00',
        '5.00', NULL, NULL),
       (32896, '殷茂', '13827621786', '35141.00', '1005', 85, NULL, '第18大街第18号楼1单元379门', '描述527288', '766822692326742',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M02干玫瑰等9件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/286388.jpg', 28, '0.00', '30.00', '35151.00',
        '20.00', NULL, NULL),
       (32897, '齐雁', '13805804279', '16675.00', '1001', 86, NULL, '第11大街第12号楼2单元751门', '描述643494', '866266256344583',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M01醉蔷薇等6件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/878726.jpg', 21, '700.00', '70.00', '17434.00',
        '11.00', NULL, NULL),
       (32898, '杨宁欣', '13500164087', '43145.00', '1004', 88, NULL, '第3大街第37号楼1单元271门', '描述477885', '716251848677198',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z02少女红 活力青春 璀璨金钻哑光唇膏 等8件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/282493.jpg', 12, '0.00', '70.00', '43198.00',
        '17.00', NULL, NULL),
       (32899, '于贞莉', '13769930585', '38604.00', '1005', 89, NULL, '第14大街第20号楼9单元688门', '描述142424', '863777559256957',
        'TCL 75Q10 75英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等5件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/466584.jpg', 2, '500.00',
        '0.00', '39095.00', '9.00', NULL, NULL),
       (32900, '独孤志', '13352983433', '43113.00', '1004', 91, NULL, '第9大街第7号楼1单元516门', '描述149798', '624454198677378',
        'Apple iPhone 12 (A2404) 64GB 黑色 支持移动联通电信5G 双卡双待手机等7件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/435996.jpg', 17, '0.00', '70.00', '43177.00',
        '6.00', NULL, NULL),
       (32901, '宇文民友', '13889829127', '7230.00', '1004', 93, NULL, '第16大街第34号楼7单元584门', '描述345959', '562938387312148',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M01醉蔷薇等6件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/527718.jpg', 30, '0.00', '70.00', '7283.00',
        '17.00', NULL, NULL),
       (32902, '朱鹏泽', '13056608797', '98236.00', '1001', 94, NULL, '第7大街第5号楼3单元677门', '描述196125', '124371287962989',
        '华为智慧屏V55i-J 55英寸 HEGE-550B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 银钻灰 京品家电等14件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/768291.jpg', 8, '700.00',
        '0.00', '98928.00', '8.00', NULL, NULL),
       (32903, '韩树', '13880248129', '44712.00', '1001', 96, NULL, '第13大街第14号楼9单元943门', '描述536816', '889869273483786',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 冰雾白 游戏智能手机 小米 红米等10件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/836248.jpg', 11, '0.00', '70.00', '44774.00', '8.00', NULL, NULL),
       (32904, '华波', '13499065380', '221.00', '1005', 97, NULL, '第2大街第5号楼5单元516门', '描述966351', '263212759928951',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M01醉蔷薇等6件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/883964.jpg', 1, '0.00', '70.00', '286.00',
        '5.00', NULL, NULL),
       (32905, '长孙伦', '13072155370', '23856.00', '1004', 99, NULL, '第10大街第4号楼6单元883门', '描述195945', '476251322591374',
        '华为智慧屏V55i-J 55英寸 HEGE-550B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 银钻灰 京品家电等6件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/462483.jpg', 23, '0.00',
        '0.00', '23850.00', '6.00', NULL, NULL),
       (32906, '蒋群豪', '13959087795', '25123.00', '1001', 104, NULL, '第15大街第33号楼2单元261门', '描述732397', '873471396685228',
        '华为 HUAWEI P40 麒麟990 5G SoC芯片 5000万超感知徕卡三摄 30倍数字变焦 6GB+128GB亮黑色全网通5G手机等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/517141.jpg', 3, '700.00',
        '30.00', '25841.00', '12.00', NULL, NULL),
       (32907, '毛晓欢', '13888293374', '20291.00', '1004', 105, NULL, '第20大街第22号楼2单元444门', '描述915396', '753351324358583',
        '华为智慧屏V55i-J 55英寸 HEGE-550B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 银钻灰 京品家电等8件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/845736.jpg', 12, '0.00',
        '30.00', '20302.00', '19.00', NULL, NULL),
       (32908, '南门黛青', '13331711431', '44997.00', '1004', 107, NULL, '第18大街第19号楼9单元942门', '描述828164', '739651121112889',
        '华为智慧屏V55i-J 55英寸 HEGE-550B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 银钻灰 京品家电等8件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/568973.jpg', 5, '0.00',
        '0.00', '44990.00', '7.00', NULL, NULL),
       (32909, '欧阳娟英', '13945206417', '138.00', '1001', 111, NULL, '第6大街第24号楼1单元996门', '描述949681', '512584551944695',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Y01复古红 百搭气质 璀璨金钻哑光唇膏 等2件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/738721.jpg', 17, '0.00', '70.00', '188.00',
        '20.00', NULL, NULL),
       (32910, '于利清', '13895196806', '4054.00', '1004', 113, NULL, '第9大街第38号楼3单元818门', '描述151259', '322744764743797',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 8GB+128GB 明月灰 游戏智能手机 小米 红米等6件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/864858.jpg', 19, '0.00', '30.00', '4074.00', '10.00', NULL, NULL),
       (32911, '庞承', '13561135898', '9910.00', '1004', 117, NULL, '第16大街第31号楼3单元734门', '描述245728', '723215597692986',
        '小米电视4A 70英寸 4K超高清 HDR 二级能效 2GB+16GB L70M5-4A 内置小爱 智能网络液晶平板教育电视等3件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/913546.jpg', 24, '0.00',
        '0.00', '9897.00', '13.00', NULL, NULL),
       (32912, '公孙鸣', '13434734575', '2677.00', '1001', 119, NULL, '第7大街第29号楼1单元683门', '描述468334', '552312783955479',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z03女王红 性感冷艳 璀璨金钻哑光唇膏 等3件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/349246.jpg', 12, '0.00', '30.00', '2697.00',
        '10.00', NULL, NULL),
       (32913, '熊朗伯', '13563926369', '21128.00', '1004', 120, NULL, '第18大街第34号楼7单元413门', '描述223889', '894385525315883',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 明月灰 游戏智能手机 小米 红米等8件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/733358.jpg', 20, '0.00', '70.00', '21182.00', '16.00', NULL, NULL),
       (32914, '陈茂', '13683217720', '55702.00', '1004', 125, NULL, '第14大街第31号楼6单元877门', '描述326825', '337387681795626',
        'TCL 75Q10 75英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等12件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/323778.jpg', 4, '0.00',
        '70.00', '55760.00', '12.00', NULL, NULL),
       (32915, '欧阳春', '13363036318', '27851.00', '1004', 129, NULL, '第11大街第14号楼3单元543门', '描述244717', '633394165877649',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 冰雾白 游戏智能手机 小米 红米等8件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/346893.jpg', 22, '0.00', '0.00', '27838.00', '13.00', NULL, NULL),
       (32916, '赵昭', '13004433114', '17043.00', '1004', 133, NULL, '第14大街第36号楼8单元664门', '描述511914', '113145598214784',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z02少女红 活力青春 璀璨金钻哑光唇膏 等6件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/514725.jpg', 34, '0.00', '70.00', '17094.00',
        '19.00', NULL, NULL),
       (32917, '吴航弘', '13872403903', '11860.00', '1004', 136, NULL, '第19大街第23号楼9单元786门', '描述464218', '618937829689884',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z03女王红 性感冷艳 璀璨金钻哑光唇膏 等4件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/399351.jpg', 13, '0.00', '30.00', '11880.00',
        '10.00', NULL, NULL),
       (32918, '姜卿聪', '13778758582', '28106.00', '1005', 137, NULL, '第19大街第28号楼4单元365门', '描述949783', '862123931819654',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 8GB+128GB 冰雾白 游戏智能手机 小米 红米等8件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/724165.jpg', 14, '0.00', '0.00', '28089.00', '17.00', NULL, NULL),
       (32919, '潘青倩', '13900114781', '12013.00', '1005', 138, NULL, '第18大街第28号楼7单元278门', '描述592596', '616914282634662',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z02少女红 活力青春 璀璨金钻哑光唇膏 等7件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/184598.jpg', 34, '0.00', '70.00', '12063.00',
        '20.00', NULL, NULL),
       (32920, '孟秀娟', '13415368778', '42646.00', '1004', 139, NULL, '第16大街第32号楼8单元755门', '描述241149', '589244595976224',
        '小米电视E65X 65英寸 全面屏 4K超高清HDR 蓝牙遥控内置小爱 2+8GB AI人工智能液晶网络平板电视 L65M5-EA等7件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/487356.jpg', 27, '0.00',
        '30.00', '42671.00', '5.00', NULL, NULL),
       (32921, '夏侯波宁', '13450297496', '37321.00', '1001', 141, NULL, '第11大街第31号楼5单元119门', '描述414619', '951854931336489',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Y01复古红 百搭气质 璀璨金钻哑光唇膏 等11件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/925857.jpg', 10, '0.00', '100.00', '37402.00',
        '19.00', NULL, NULL),
       (32922, '独孤钧冠', '13460476981', '24400.00', '1004', 143, NULL, '第2大街第13号楼5单元512门', '描述764662', '945846992817569',
        'Apple iPhone 12 (A2404) 128GB 黑色 支持移动联通电信5G 双卡双待手机等4件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/785865.jpg', 19, '0.00', '0.00', '24383.00',
        '17.00', NULL, NULL),
       (32923, '柳玲', '13674046851', '33003.00', '1001', 145, NULL, '第6大街第10号楼7单元316门', '描述388794', '334796992855656',
        'Apple iPhone 12 (A2404) 64GB 红色 支持移动联通电信5G 双卡双待手机等5件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/894713.jpg', 29, '700.00', '0.00', '33691.00',
        '12.00', NULL, NULL),
       (32924, '卫滢', '13671504169', '43892.00', '1004', 146, NULL, '第19大街第17号楼4单元315门', '描述523218', '416425316833559',
        '华为智慧屏V65i 65英寸 HEGE-560B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 4GB+32GB 星际黑等6件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/157853.jpg', 3, '0.00',
        '0.00', '43883.00', '9.00', NULL, NULL),
       (32925, '穆辉力', '13196852933', '26606.00', '1005', 148, NULL, '第9大街第32号楼3单元987门', '描述762386', '277526872332624',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 冰雾白 游戏智能手机 小米 红米等5件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/454555.jpg', 29, '700.00', '0.00', '27295.00', '11.00', NULL, NULL),
       (32926, '鲍绍', '13691239672', '12080.00', '1005', 152, NULL, '第7大街第32号楼2单元541门', '描述421197', '632361973415878',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z03女王红 性感冷艳 璀璨金钻哑光唇膏 等3件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/376828.jpg', 2, '0.00', '30.00', '12097.00',
        '13.00', NULL, NULL),
       (32927, '元茂进', '13183373664', '32983.00', '1005', 153, NULL, '第17大街第10号楼1单元358门', '描述141225', '796886428412193',
        '十月稻田 长粒香大米 东北大米 东北香米 5kg等8件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL,
        NULL, NULL, 'http://img.gmall.com/511199.jpg', 27, '0.00', '30.00', '33004.00', '9.00', NULL, NULL),
       (32928, '卫承乐', '13279623909', '34666.00', '1004', 155, NULL, '第20大街第7号楼6单元494门', '描述792625', '417271286657631',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M01醉蔷薇等7件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/722266.jpg', 27, '0.00', '30.00', '34686.00',
        '10.00', NULL, NULL),
       (32929, '毛娅', '13714146274', '9020.00', '1005', 159, NULL, '第11大街第37号楼4单元854门', '描述259719', '299366116579735',
        '华为 HUAWEI P40 麒麟990 5G SoC芯片 5000万超感知徕卡三摄 30倍数字变焦 8GB+128GB亮黑色全网通5G手机等5件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/771814.jpg', 31, '0.00',
        '0.00', '9009.00', '11.00', NULL, NULL),
       (32930, '郑斌梁', '13192296725', '9292.00', '1004', 163, NULL, '第15大街第26号楼8单元289门', '描述191156', '223246638879764',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 明月灰 游戏智能手机 小米 红米等8件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/169645.jpg', 10, '0.00', '30.00', '9304.00', '18.00', NULL, NULL),
       (32931, '马君琴', '13075455502', '27970.00', '1001', 165, NULL, '第17大街第25号楼5单元117门', '描述617919', '744173722457985',
        'TCL 85Q6 85英寸 巨幕私人影院电视 4K超高清 AI智慧屏 全景全面屏 MEMC运动防抖 2+16GB 液晶平板电视机等6件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/995134.jpg', 31, '0.00',
        '0.00', '27958.00', '12.00', NULL, NULL),
       (32932, '陈子杰', '13593755547', '34600.00', '1005', 166, NULL, '第12大街第3号楼5单元347门', '描述924378', '749521899394228',
        '小米10 至尊纪念版 双模5G 骁龙865 120HZ高刷新率 120倍长焦镜头 120W快充 8GB+128GB 陶瓷黑 游戏手机等11件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/934836.jpg', 28, '700.00',
        '0.00', '35280.00', '20.00', NULL, NULL),
       (32933, '华时', '13857576135', '18008.00', '1004', 167, NULL, '第11大街第7号楼6单元781门', '描述168241', '557187722999819',
        '小米10 至尊纪念版 双模5G 骁龙865 120HZ高刷新率 120倍长焦镜头 120W快充 8GB+128GB 透明版 游戏手机等3件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/567923.jpg', 25, '0.00',
        '0.00', '17997.00', '11.00', NULL, NULL),
       (32934, '郑琴蕊', '13331318412', '8535.00', '1001', 169, NULL, '第17大街第1号楼6单元322门', '描述139394', '571438541373524',
        '十月稻田 辽河长粒香 东北大米 5kg等5件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL,
        NULL, 'http://img.gmall.com/781746.jpg', 17, '0.00', '0.00', '8525.00', '10.00', NULL, NULL),
       (32935, '上官秋珊', '13935449951', '41316.00', '1004', 170, NULL, '第20大街第17号楼6单元453门', '描述656114', '282185497438194',
        'Apple iPhone 12 (A2404) 64GB 白色 支持移动联通电信5G 双卡双待手机等9件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/677923.jpg', 16, '0.00', '70.00', '41371.00',
        '15.00', NULL, NULL),
       (32936, '祁健', '13425083207', '8215.00', '1005', 171, NULL, '第7大街第32号楼2单元445门', '描述267427', '464177927387595',
        'Apple iPhone 12 (A2404) 64GB 红色 支持移动联通电信5G 双卡双待手机等1件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/328159.jpg', 26, '0.00', '0.00', '8197.00',
        '18.00', NULL, NULL),
       (32937, '呼延珠翠', '13236112176', '4005.00', '1005', 174, NULL, '第1大街第29号楼7单元179门', '描述721144', '541625394388194',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 4GB+128GB 冰雾白 游戏智能手机 小米 红米等4件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/491215.jpg', 15, '0.00', '0.00', '3996.00', '9.00', NULL, NULL),
       (32938, '闻人岚艺', '13771107100', '34100.00', '1001', 175, NULL, '第18大街第35号楼1单元511门', '描述997323', '739953882471313',
        'Apple iPhone 12 (A2404) 64GB 黑色 支持移动联通电信5G 双卡双待手机等5件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/233381.jpg', 25, '0.00', '0.00', '34087.00',
        '13.00', NULL, NULL),
       (32939, '滕山仁', '13323876579', '67404.00', '1005', 176, NULL, '第17大街第38号楼8单元767门', '描述491639', '661534399431599',
        'Redmi 10X 4G Helio G85游戏芯 4800万超清四摄 5020mAh大电量 小孔全面屏 128GB大存储 8GB+128GB 明月灰 游戏智能手机 小米 红米等10件商品',
        '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL,
        'http://img.gmall.com/269876.jpg', 29, '700.00', '0.00', '68084.00', '20.00', NULL, NULL),
       (32940, '袁良海', '13734780163', '13410.00', '1004', 179, NULL, '第2大街第23号楼9单元938门', '描述377931', '525328544754311',
        'TCL 65Q10 65英寸 QLED原色量子点电视 安桥音响 AI声控智慧屏 超薄全面屏 MEMC防抖 3+32GB 平板电视等2件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/235331.jpg', 1, '0.00',
        '0.00', '13398.00', '12.00', NULL, NULL),
       (32941, '冯克伦', '13306614489', '12400.00', '1001', 182, NULL, '第6大街第19号楼8单元629门', '描述718194', '876381522682855',
        '华为智慧屏V65i 65英寸 HEGE-560B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 4GB+32GB 星际黑等8件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/954532.jpg', 7, '0.00',
        '70.00', '12456.00', '14.00', NULL, NULL),
       (32942, '卜泽', '13873312549', '4198.00', '1004', 183, NULL, '第3大街第3号楼5单元277门', '描述282368', '818469694494933',
        '华为 HUAWEI P40 麒麟990 5G SoC芯片 5000万超感知徕卡三摄 30倍数字变焦 6GB+128GB亮黑色全网通5G手机等1件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/559823.jpg', 4, '0.00',
        '0.00', '4188.00', '10.00', NULL, NULL),
       (32943, '成林有', '13450780950', '27690.00', '1001', 185, NULL, '第19大街第13号楼9单元619门', '描述975139', '186247398534321',
        '金沙河面条 银丝挂面900g*3包 爽滑 细面条 龙须面 速食面等6件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33', '2021-10-18 19:50:32',
        NULL, NULL, NULL, 'http://img.gmall.com/483589.jpg', 5, '0.00', '0.00', '27676.00', '14.00', NULL, NULL),
       (32944, '臧婵雁', '13507847543', '9914.00', '1004', 187, NULL, '第16大街第13号楼5单元962门', '描述951521', '132412351213354',
        '小米10 至尊纪念版 双模5G 骁龙865 120HZ高刷新率 120倍长焦镜头 120W快充 8GB+128GB 透明版 游戏手机等4件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/893436.jpg', 2, '0.00',
        '0.00', '9896.00', '18.00', NULL, NULL),
       (32945, '彭芸菲', '13918836347', '67797.00', '1001', 188, NULL, '第7大街第19号楼6单元723门', '描述668379', '277873562784358',
        '索芙特i-Softto 口红不掉色唇膏保湿滋润 璀璨金钻哑光唇膏 Z02少女红 活力青春 璀璨金钻哑光唇膏 等13件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/888741.jpg', 14, '700.00', '30.00', '68507.00',
        '20.00', NULL, NULL),
       (32946, '钱素', '13238335618', '50976.00', '1004', 189, NULL, '第9大街第9号楼8单元416门', '描述677246', '383483732515711',
        'Apple iPhone 12 (A2404) 64GB 黑色 支持移动联通电信5G 双卡双待手机等9件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/728789.jpg', 14, '700.00', '0.00', '51665.00',
        '11.00', NULL, NULL),
       (32947, '韦辉', '13839882344', '30473.00', '1004', 193, NULL, '第11大街第7号楼9单元111门', '描述958969', '145662792242757',
        'TCL 85Q6 85英寸 巨幕私人影院电视 4K超高清 AI智慧屏 全景全面屏 MEMC运动防抖 2+16GB 液晶平板电视机等6件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/329784.jpg', 27, '0.00',
        '0.00', '30461.00', '12.00', NULL, NULL),
       (32948, '诸葛青', '13439363935', '85.00', '1001', 196, NULL, '第10大街第3号楼2单元192门', '描述343619', '496828715395247',
        'CAREMiLLE珂曼奶油小方口红 雾面滋润保湿持久丝缎唇膏 M02干玫瑰等3件商品', '2021-10-18 19:35:32', '2021-10-18 19:35:33',
        '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/484799.jpg', 7, '0.00', '70.00', '137.00',
        '18.00', NULL, NULL),
       (32949, '许晨', '13542064997', '57940.00', '1004', 198, NULL, '第18大街第39号楼8单元659门', '描述525438', '487859582254186',
        '小米10 至尊纪念版 双模5G 骁龙865 120HZ高刷新率 120倍长焦镜头 120W快充 8GB+128GB 陶瓷黑 游戏手机等13件商品', '2021-10-18 19:35:32',
        '2021-10-18 19:35:33', '2021-10-18 19:50:32', NULL, NULL, NULL, 'http://img.gmall.com/188763.jpg', 7, '500.00',
        '0.00', '58434.00', '6.00', NULL, NULL);

-- =====================================================================================================


create table if not exists source_order_tbl
(
    db_name STRING METADATA FROM 'database_name' VIRTUAL,
    table_name STRING METADATA  FROM 'table_name' VIRTUAL,
    operation_ts TIMESTAMP_LTZ(3) METADATA FROM 'op_ts' VIRTUAL,
    order_id      int,
    order_date    TIMESTAMP(0),
    customer_name string,
    price         decimal(10, 5),
    product_id    int,
    order_status  boolean,
    primary key (order_id) NOT ENFORCED
) WITH (
    'connector' = 'mysql-cdc',
    'hostname' = 'hadoop102',
    'port' = '3306',
    'username' = 'root',
    'password' = 'root',
    'connect.timeout' = '30s',
    'connect.max-retries' = '3',
    'connection.pool.size' = '5',
    'jdbc.properties.useSSL' = 'false',
    'jdbc.properties.characterEncoding' = 'utf-8',
    'database-name' = 'gmall_report',
    'table-name' = 'orders_tbl'
)













